Documents/ЗапросСправки2НДФЛСотрудником.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗапросСправки2НДФЛСотрудником</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросОбработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеСправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияСправок2НДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериодаСправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/НазначенияСправок2НДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>НазначенияСправок2НДФЛ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеДоходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляДекларации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗапросСправки2НДФЛСотрудником/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект,
			Новый Структура("Ответственный", "Объект.Ответственный"));
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "ГруппаКнопокРаботаСФайлами";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	ЗаполнитьСотрудников();
	ЗаполнитьСписокВыбораОрганизации();
	УстановитьОрганизациюИГод();
	УстановитьВидПериодаСправки();
	
	УстановитьОтображениеЭлементов();
	
КонецПроцедуры

// Параметры:
//  ТекущийОбъект - ДокументОбъект.ЗапросСправки2НДФЛСотрудником
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ЗапросСправкиСотрудником", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайлами.ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, Параметры);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
// Параметры:
//  ТекущийОбъект - ДокументОбъект.ЗапросСправки2НДФЛСотрудником
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НазначениеСправкиПриИзменении(Элемент)
	НазначениеСправкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПредставлениеПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект, "Объект.НачалоПериода", "НачалоПериодаПредставление",
		Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	ФизическоеЛицоПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПредставлениеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Объект.НачалоПериода", "НачалоПериодаПредставление",
		Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПредставлениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание,
		СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
	СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтотОбъект, ЭтотОбъект, "Объект.НачалоПериода",
		"НачалоПериодаПредставление");
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПредставлениеПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект, "Объект.КонецПериода", "КонецПериодаПредставление",
		Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПредставлениеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Объект.КонецПериода", "КонецПериодаПредставление",
		Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПредставлениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание,
	СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
	СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтотОбъект, ЭтотОбъект, "Объект.КонецПериода",
		"КонецПериодаПредставление");
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаСправкиПриИзменении(Элемент)
	
	ВидПериодаСправкиПриИзмененииНаСервере();
	
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(
		ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(
		ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.ПодключаемыеКоманды
// 
// Параметры:
//  Команда - КомандаФормы
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура УстановитьОтображениеЭлементов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапросОбработан", "ТолькоПросмотр",
		Не Пользователи.РолиДоступны(Метаданные.Роли.СогласованиеЗапросовСправокСотрудником.Имя));
		
	Если Объект.НазначениеСправки = Перечисления.НазначенияСправок2НДФЛ.ДляДекларации Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГод", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПериод", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПредставлениеПериода",
			"Видимость", Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГод", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПериод", "Видимость", Истина);
		Если Объект.КоличествоМесяцев = 0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПредставлениеПериода",
				"Видимость", Истина);
			НачалоПериодаПредставление = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(Объект.НачалоПериода);
			КонецПериодаПредставление = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(Объект.КонецПериода);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПредставлениеПериода",
				"Видимость", Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Возвращаемое значение:
//  Структура - Виды периодов справки:
// * Последние3Месяца - Структура:
//   ** Идентификатор - Строка
//   ** КоличествоМесяцев - Число
// * ПоследниеПолгода - Структура:
//   ** Идентификатор - Строка
//   ** КоличествоМесяцев - Число
// * Последние9Месяцев - Структура:
//   ** Идентификатор - Строка
//   ** КоличествоМесяцев - Число
// * Последние12Месяцев - Структура:
//   ** Идентификатор - Строка
//   ** КоличествоМесяцев - Число
// * Произвольный - Структура:
//   ** Идентификатор - Строка
//   ** КоличествоМесяцев - Число
&НаКлиентеНаСервереБезКонтекста
Функция ВидыПериодовСправки()

	ВидыПериодовСправки = Новый Структура;
	
	ВидыПериодовСправки.Вставить("Последние3Месяца",
		Новый Структура("Идентификатор, КоличествоМесяцев", "Последние3Месяца", 3));
		
	ВидыПериодовСправки.Вставить("ПоследниеПолгода",
		Новый Структура("Идентификатор, КоличествоМесяцев", "ПоследниеПолгода", 6));
		
	ВидыПериодовСправки.Вставить("Последние9Месяцев",
		Новый Структура("Идентификатор, КоличествоМесяцев", "Последние9Месяцев", 9));
		
	ВидыПериодовСправки.Вставить("Последние12Месяцев",
		Новый Структура("Идентификатор, КоличествоМесяцев", "Последние12Месяцев", 12));
		
	ВидыПериодовСправки.Вставить("Произвольный",
		Новый Структура("Идентификатор, КоличествоМесяцев", "Произвольный", 0));
	
	Возврат ВидыПериодовСправки;
	
КонецФункции

&НаСервере
Процедура УстановитьВидПериодаСправки()
	
	ВидПериодаСправки = "Произвольный";
	
	ВидыПериодов = ВидыПериодовСправки();
	
	Для Каждого КлючЗначение Из ВидыПериодов Цикл
		Если КлючЗначение.Значение.КоличествоМесяцев = Объект.КоличествоМесяцев Тогда
			ВидПериодаСправки = КлючЗначение.Значение.Идентификатор;
			Возврат;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

// Количество месяцев.
// 
// Параметры:
//  ВидПериодаСправки - Строка
// 
// Возвращаемое значение:
//  Число
&НаСервере
Функция КоличествоМесяцев(ВидПериодаСправки)
	
	КоличествоМесяцев = 0;
	
	ВидыПериодов = ВидыПериодовСправки();
	
	Для Каждого КлючЗначение Из ВидыПериодов Цикл
		Если КлючЗначение.Значение.Идентификатор = ВидПериодаСправки Тогда
			КоличествоМесяцев = КлючЗначение.Значение.КоличествоМесяцев;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КоличествоМесяцев;
		
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораГода()
	
	Элементы.Год.СписокВыбора.Очистить();
	
	Если Не ЗначениеЗаполнено(Объект.ФизическоеЛицо) Или Не ЗначениеЗаполнено(Объект.Организация)
		Или Сотрудники.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	НайденныеСтроки = Сотрудники.НайтиСтроки(Новый Структура("Организация", Объект.Организация));
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийГод = Год(ТекущаяДатаСеанса());
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		ГодНачала = Макс(Год(ТекущаяСтрока.ДатаПриема), 2010);
		Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаУвольнения) Тогда
			ГодОкончания = Мин(Год(ТекущаяСтрока.ДатаУвольнения), ТекущийГод);
		Иначе
			ГодОкончания = ТекущийГод;
		КонецЕсли;
		Для Сч = ГодНачала По ГодОкончания Цикл
			Если Элементы.Год.СписокВыбора.НайтиПоЗначению(Сч) = Неопределено Тогда
				Элементы.Год.СписокВыбора.Добавить(Сч, Формат(Сч, "ЧГ=0;"));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Если ЗначениеЗаполнено(Объект.Год)
		И Элементы.Год.СписокВыбора.НайтиПоЗначению(Объект.Год) = Неопределено Тогда
		Элементы.Год.СписокВыбора.Добавить(Объект.Год, Формат(Объект.Год, "ЧГ=0"));
	КонецЕсли;
	
	Элементы.Год.СписокВыбора.СортироватьПоЗначению();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСотрудников()
	
	Сотрудники.Очистить();
	Если Не ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Объект.ФизическоеЛицо);
	ПараметрыПолученияСотрудников.КадровыеДанные = "Организация,ДатаПриема,ДатаУвольнения";
	
	УстановитьПривилегированныйРежим(Истина);
	СотрудникиФизическогоЛица = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолученияСотрудников);
	УстановитьПривилегированныйРежим(Ложь);

	Сотрудники.Загрузить(СотрудникиФизическогоЛица.Скопировать(, "Сотрудник,Организация,ДатаПриема,ДатаУвольнения"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОрганизации()
	
	Элементы.Организация.СписокВыбора.Очистить();
	
	Если Сотрудники.Количество() > 0 Тогда
		ТаблицаОрганизаций = Сотрудники.Выгрузить(, "Организация");
		Организации = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаОрганизаций, "Организация", Истина);
		Элементы.Организация.СписокВыбора.ЗагрузитьЗначения(Организации);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация)
		И Элементы.Организация.СписокВыбора.НайтиПоЗначению(Объект.Организация) = Неопределено Тогда
		Элементы.Организация.СписокВыбора.Добавить(Объект.Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ФизическоеЛицоПриИзмененииНаСервере()

	Объект.Организация = Неопределено;
	Объект.Год = Неопределено;
	
	ЗаполнитьСотрудников();
	ЗаполнитьСписокВыбораОрганизации();
	УстановитьОрганизациюИГод();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОрганизациюИГод()
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		СписокВыбора = Элементы.Организация.СписокВыбора; // СписокЗначений из СправочникСсылка.Организации
		Если СписокВыбора.Количество() = 0 Тогда
			Объект.Организация = Неопределено;
		ИначеЕсли СписокВыбора.Количество() = 1 Тогда
			Объект.Организация = СписокВыбора[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСписокВыбораГода();
	ЗаполнитьГод();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Объект.Год = Неопределено;
	
	ЗаполнитьСписокВыбораГода();
	ЗаполнитьГод();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГод()

	Если ЗначениеЗаполнено(Объект.Год) Тогда
		Возврат;
	КонецЕсли;
	
	ГодыСписок = Элементы.Год.СписокВыбора; // СписокЗначений из Число
	РазмерСписка = ГодыСписок.Количество();
	
	Если РазмерСписка = 0 Тогда
		Возврат;
	ИначеЕсли РазмерСписка = 1 Тогда
		Объект.Год = ГодыСписок.Получить(0).Значение;
	ИначеЕсли ГодыСписок.Получить(РазмерСписка - 1).Значение = Год(ТекущаяДатаСеанса()) Тогда
		Объект.Год = ГодыСписок.Получить(РазмерСписка - 2).Значение;
	Иначе
		Объект.Год = ГодыСписок.Получить(РазмерСписка - 1).Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидПериодаСправкиПриИзмененииНаСервере()
	
	Объект.КоличествоМесяцев = КоличествоМесяцев(ВидПериодаСправки);
	Если Объект.КоличествоМесяцев = 0 Тогда
		НачалоТекущегоГода = НачалоГода(ТекущаяДатаСеанса());
		Объект.КонецПериода = НачалоТекущегоГода - 1;
		Объект.НачалоПериода = НачалоГода(Объект.КонецПериода);
	Иначе
		Объект.НачалоПериода = Дата(1, 1, 1);
		Объект.КонецПериода = Дата(1, 1, 1);
	КонецЕсли;
	
	УстановитьОтображениеЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура НазначениеСправкиПриИзмененииНаСервере()
	
	Если Объект.НазначениеСправки = Перечисления.НазначенияСправок2НДФЛ.ПодтверждениеДоходов Тогда
		Объект.Год = Неопределено;
	Иначе
		ЗаполнитьГод();
	КонецЕсли;
	
	УстановитьОтображениеЭлементов();
	
КонецПроцедуры

#КонецОбласти
